citrixhoneypot/logs/server.log

{"asctime": "2022-04-18 15:38:08,062", "levelname": "INFO", "message": "Citrix CVE-2019-19781 Honeypot by MalwareTech"}
{"asctime": "2022-04-18 16:00:15,892", "levelname": "INFO", "message": "(46.161.27.143:56570): POST Header: /autodiscover/autodiscover.json?a=a@edu.edu/ews/exchange.asmx"}
{"asctime": "2022-04-18 16:00:15,895", "levelname": "INFO", "message": "(46.161.27.143:56570): POST body: <soap:Envelope\nxmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\"\nxmlns:m=\"http://schemas.microsoft.com/exchange/services/2006/messages\"\nxmlns:t=\"http://schemas.microsoft.com/exchange/services/2006/types\"\nxmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\">\n<soap:Header>\n  <t:RequestServerVersion Version=\"Exchange2016\" />\n</soap:Header>\n<soap:Body>\n  <m:ResolveNames ReturnFullContactData=\"true\" SearchScope=\"ActiveDirectory\">\n    <m:UnresolvedEntry>SMTP:a</m:UnresolvedEntry>\n  </m:ResolveNames>\n</soap:Body>\n</soap:Envelope>"}
{"asctime": "2022-04-19 05:23:51,039", "levelname": "INFO", "message": "(162.142.125.219:58638): GET Header: /"}
{"asctime": "2022-04-19 05:56:24,507", "levelname": "INFO", "message": "(45.155.204.146:57452): POST Header: /cgi-bin/../../../../bin/sh"}
